mridulp-jft/telecom-gps/vtsOBD-2.0.0 - nuc130/KEIL/main.c
/*----------------------------------------------------------------------------
 * CMSIS-RTOS 'main' function template
 *---------------------------------------------------------------------------*/

#define osObjectsPublic                     // define objects in main module
#include "osObjects.h"                      // RTOS object definitions

/****************************************************************************
 * @file     main.c
 * @version  V2.00
 * $Revision: 1 $
 * $Date: 14/12/08 11:50a $
 * @brief    Transmit and receive data from PC terminal through RS232 interface.
 * @note
 * Copyright (C) 2014 Nuvoton Technology Corp. All rights reserved.
 *
 ******************************************************************************/
#include <math.h>
#include <stdio.h>
#include <stdlib.h>
#include <string.h>
//#include <cstdlib.h>
#include "NUC100Series.h"
#include "WinboundFlash.h"
#include "preprocessor.h"
#include "i2c.h"
//*********configuration variables**************
    uint32_t u32BusClock;
int16_t OUT_Y_H_A,  OUT_X_H_A,  OUT_Z_H_A, OUT_X_L_A, OUT_Y_L_A, OUT_Z_L_A, STATUS_REG_A, CTRL_REG4_A;
int ay,ax,az = -1;
int gy,gx,gz = -1;
float aay,aax,aaz = -1;
int ggy,ggx,ggz = -1;
int simselect = 0; 
char IP1[50] = "104.236.203.4";
char PORT1[10] = "5557";
char IP2[50] = "159.89.254.53";
char PORT2[10] = "5556";
char vehicleregnum[15] = "DL15AN1234";
char apn1[20] = "airtelgprs.com";
char apn2[20] = "internet";
volatile float overspeed = 0, harshacc = 0,harshbrake = 0,rashturn = 0; 
extern volatile int wakeinterval_emer;
extern volatile int sleepinterval_i0;
extern volatile int sleepinterval_i1;
volatile int ring = 0;
extern float readpt;
extern volatile int tc;
extern volatile int loginpacket;
extern volatile int32_t tmr0sec;
extern volatile int ignition;
extern volatile int emergencystatus;  
extern int tcpsendchtimer;
extern volatile char tamperalert;
extern char emernum1[15];
extern char emernum2[15];
extern char networkoperator[30];
uint8_t antennaselect = 0;
extern uint8_t alertid;
extern int fix;
volatile int g_u32AdcIntFlag;
volatile int netselect;
volatile int ignitionhighlow = 0;
volatile int emergencyhighlow = 0;
//**********************************************
uint8_t tmr1sec;
volatile uint32_t wetmr;
volatile int interval_count = 0;
volatile int interval_count_health = 0;
extern volatile int sleepinterval_health;
extern char cregresp[10];
char firmwaresize[20] = 0;
char messagedata[200];
volatile uint8_t input1, input2, input3, input4;
extern   int sleepinterval;
/*---------------------------------------------------------------------------------------------------------*/
/* Extern variables                                                                                        */
/*---------------------------------------------------------------------------------------------------------*/

#ifdef OBD
extern char suppportedpid[100][7];
#endif
extern volatile int pidcounter;
extern char latitude[12];
extern char longitude[12];
extern char prevlatitude[12];
extern char prevlongitude[12];
extern char gpsdate[7];
extern char gpstime[7];
extern char kmph[6];
extern char heading[8];
extern char alt[8];
extern char sat[3];
extern char latdir[2];
extern char longdir[2];
extern char hdop[6];
extern char pdop[5];
extern char networkoperator[30];
extern char mcc[5];
extern char mnc[5];
extern char lac[5];
extern char cellid[10];
extern char packetstatus;
extern char nmr[200];
/*---------------------------------------------------------------------------------------------------------*/
/* Global variables                                                                                        */
/*---------------------------------------------------------------------------------------------------------*/

char g_u8SendData[TXBUFSIZE] = {0};
char g_u8RecData[RXBUFSIZE]	= {0};
char g_u8OBDSendData[OBDTXBUFSIZE] = {0};
char g_u8OBDRecData[OBDRXBUFSIZE]	= {0};
uint8_t g_u8OBDRecDataptr=0;
int MidDid;
volatile int parameterupgrade = 0;
volatile uint32_t g_u32comRbytes = 0;
volatile uint32_t g_u32comRhead  = 0;
volatile uint32_t g_u32comRtail  = 0;
volatile int32_t g_bWait         = TRUE;
volatile int notsentcounter= 0;
volatile int triggeruart = 0;
/*---------------------------------------------------------------------------------------------------------*/
/* Define functions prototype                                                                              */
/*---------------------------------------------------------------------------------------------------------*/
int32_t main(void);
__inline void send_sms(char* num, char* content);
__inline void SYS_Init(void);
__inline void UARTs_Init();
extern void TCP_Send_ch(char * tcpcommand,char * tcpdataq, char * tcpresponse1, char * tcpresponse2, char * tcpresponse3, int32_t tcptimeout);
void TMR0_IRQHandler(void);
void UART1_IRQHandler(void);
void UART02_IRQHandler(void);
void sms_mc60(void);
__inline void Init_IOs();
__inline void OBD_GET_PID();
__inline uint8_t I2C_Write(uint16_t u16Address, uint8_t u8Data);
__inline uint8_t I2C_Read(uint16_t u16Address);
int saveipconfigurations(void);
void readipconfigurations(void);
void smsrequest(int _case, char* arg1, char* arg2);
__inline void sendalert();
__inline void hextoascii(char* string, int len);
__inline void networkswitch();
/*---------------------------------------------------------------------------------------------------------*/
/* Extern variables                                                                              */
/*---------------------------------------------------------------------------------------------------------*/
extern void cregquerry(void);
extern void Save_FS(void);
extern volatile int32_t g_u8RecDataptr;
extern int Init_Thread (void);
extern void manualdelay(int delayms);
extern void SendAT(char * command, char * response1, char * response2, char * response3, int32_t timeout);
extern void SendAT_FS(char * command, char * response1, char * response2, char * response3, int32_t timeout);
extern void TCP_Send_ch(char * tcpcommand,char * tcpdataq, char * tcpresponse1, char * tcpresponse2, char * tcpresponse3, int32_t tcptimeout);
extern void SendAT_GPS_WO_MUTEX(char * command, char * response1, char * response2, char * response3, int32_t timeout);
extern void TCP_Send_ch(char * tcpcommand,char * tcpdataq, char * tcpresponse1, char * tcpresponse2, char * tcpresponse3, int32_t tcptimeout);
extern void TCP_Send(char * tcpcommand,char * tcpdata, char * tcpresponse1, char * tcpresponse2, char * tcpresponse3, int32_t tcptimeout);extern void Init_Timers (void);
extern void send_OBD(char * command, char * response1, char * response2, char * response3, int32_t timeout);
extern void SendAT_GPS(char * command, char * response1, char * response2, char * response3, int32_t timeout);
extern void parse_g(char* str, int first, int sec, char f, char s , char *string);
extern float batteryvoltagethreshold;
extern __inline void remove_all_chars(char* str, char c, char d);
__inline void remove_all_alpha(char* str, char c, char d);
extern void supportedpid(char command[5]);
extern  void cpinquerry();
extern int8_t charging, cpinready, cregready;
extern volatile int8_t  network;
extern float pt = 0;
extern volatile int start_thead;
extern osThreadId tid_Thread_OBD_READ;                                          // thread id
//extern osThreadId tid_Thread_GSM;                                          // thread id
osThreadId mainThreadID;
extern osThreadId tid_Thread_accgyro_READ;
extern int32_t signal;
extern int32_t signal2;
//extern char suppportedpid[200][7];
extern char DestArray[257];
extern uint8_t sendfs;
extern volatile int breaker;
extern volatile uint8_t timeoutflag;
extern char fileinstance[20];
extern char lastlocation[50];
char sender_num[15] = 0;
char ph_num[15] = 0;
extern char imei[25];
char configdata[300];
char filename[10] = "2.1.0.bin";
volatile uint32_t g_u8IsWDTTimeoutINT;
volatile uint32_t g_u32WWDTINTCount = 0;

extern char temp[100];
int updatefirmware = 0;
int8_t i2ctimeout=0;
osMutexDef (uart_mutex);		// Declare mutex
osMutexId	(uart_mutex_id); // Mutex ID	
osMutexDef (tcp_mutex);		// Declare mutex
osMutexId	(tcp_mutex_id); // Mutex ID
osMutexDef (fs_mutex);		// Declare mutex
osMutexId	(fs_mutex_id); // Mutex ID		
volatile int wait=0;
volatile uint8_t g_u8DeviceAddr = 0x6B;
volatile uint8_t g_au8TxData[3];
volatile uint8_t g_u8RxData;
volatile uint8_t g_u8DataLen;
volatile uint8_t g_u8EndFlag = 0;
volatile uint32_t u32Status = 0;
/*
 * main: initialize and start the system
 */
int main (void) {
  int one = 0;

  SYS_UnlockReg();                          // Unlock Registers
  SYS_Init();                               // Initialise System
  SYS_LockReg();                            // Lock Registers
  TIMER_Open(TIMER0, TIMER_PERIODIC_MODE, 1);
  TIMER_EnableInt(TIMER0);
  NVIC_EnableIRQ(TMR0_IRQn);
  TIMER_Start(TIMER0);
  ADC_Open(ADC, ADC_ADCR_DIFFEN_SINGLE_END, ADC_ADCR_ADMD_CONTINUOUS, 0x7f);
  ADC_POWER_ON(ADC);
  ADC_EnableInt(ADC, ADC_ADF_INT);  
  NVIC_EnableIRQ(ADC_IRQn);
  Open_SPI_Flash();         
  // Initialise SPI Flash  
  //Init_Timers();                            // Initialise Timers
  cregready  =   Init_Thread ();
  osKernelInitialize ();                    // initialise CMSIS-RTOS

  SYS_UnlockReg();
  g_u8IsWDTTimeoutINT = 0;
  WWDT_Open(WWDT_PRESCALER_768, 0x20, TRUE);  
  WDT_EnableInt();
  NVIC_EnableIRQ(WDT_IRQn);  
  SYS_LockReg();                            // Lock Registers

