mridulp-jft/telecom-gps/vtsOBD-2.0.0 - nuc130/KEIL/main.c
  //Init_IOs();                               // Initialise Input/Outputs
  UARTs_Init();                             // Initialise UARTs
  osKernelStart ();                         // start thread execution 
  MidDid = SpiFlash_ReadMidDid();
  MidDid = SpiFlash_ReadMidDid();
  #ifdef OBD
    OBD_GET_PID();
  #endif
  mainThreadID = osThreadGetId();
PA7 = 1;
//SpiFlash_ChipErase();
//pt = readpt = 0;
//saveipconfigurations();

memset(temp,0,100);
//SendAT("\r\nAT+CFUN=1,1\r\n", "OK", "NOT INSERTED" , "ERROR",5);
sprintf(temp,"\r\nAT+**********************************%s*******************************\r\n\r\n", firmwareversion);
SendAT(temp, "OK", "NOT INSERTED" , "ERROR",5);
SendAT(temp, "OK", "NOT INSERTED" , "ERROR",5);

SendAT("\r\nAT+QSCLK=1\r\n\r\n", "Ready", "OK" , "ERROR",5);
SendAT("\r\nAT+QSTK?\r\n\r\n", "OK", "NOT INSERTED" , "ERROR",5);
SendAT("\r\nAT+QSTK=1\r\n\r\n", "OK", "NOT INSERTED" , "ERROR",5);
//send_sms("8287324005", "I am Rudra"); 
//accgyroconfig();
//saveipconfigurations();
readipconfigurations();
  while (1) {
    //saveipconfigurations();
    //readipconfigurations();
    netselect = 1;
    SendAT("\r\nAT+CFUN=1\r\n\r\n", "OK", "NOT INSERTED" , "ERROR",10);
    if(netselect == 1){
      SendAT("\r\nAT+QDSIM=0\r\n\r\n", "OK", "NOT INSERTED" , "ERROR",5);
    }else{
      SendAT("\r\nAT+QDSIM=1\r\n\r\n", "OK", "NOT INSERTED" , "ERROR",5); 
    }

    SendAT_GPS("\r\n\r\nAT+QGNSSRD=\"NMEA/RMC\"\r\n\r\n\r\n", "MGPSSTATUS", "OK" , "ERROR",5);	
    if(network == 1){
      cpinquerry();
      if(cpinready==1){
        cregquerry();
        //if(cregready == 1)
          {
            SendAT("\r\nAT+CGREG?\r\n\r\n", "Ready", "OK" , "ERROR",5);
            if(netselect == 1){
              SendAT("\r\nAT+STKTR=\"810301218082028281830100\"\r\n", "+STKPCI: 0", "NAK" , "NAK",2);   //international
              manualdelay(5);
              memset(configdata,0,300);
              parse_g(g_u8RecData,3,4,'"','"',configdata);  
              hextoascii(configdata,strlen(configdata));
              // Switch to international .  You need to give command AT+STKTR="810301240082028281830100900101"  For National Switch
              if(strstr(DestArray,"National(ON)")){
                simselect = 1;
                //SendAT("\r\nAT+COPS=1,2,\"40404\"\r\n", "+STKPCI: 0", "NAK" , "NAK",5);
              }else if(strstr(DestArray,"International(ON)")){
                simselect = 2;
                //SendAT("\r\nAT+COPS=1,2,\"40404\"\r\n", "+STKPCI: 0", "NAK" , "NAK",5);
              }else{
                SendAT("\r\nAT+STKENV=\"D30782020181900101\"\r\n", "+STKPCI: 0", "NAK" , "NAK",5);
                manualdelay(5);
                memset(configdata,0,300);
                parse_g(g_u8RecData,3,4,'"','"',configdata);  
                hextoascii(configdata,strlen(configdata));
                // Switch to international .  You need to give command AT+STKTR="810301240082028281830100900101"  For National Switch
                if(strstr(DestArray,"National(ON)")){
                  simselect = 1;
                }else if(strstr(DestArray,"International(ON)")){
                  simselect = 2;
                }
              }
              //parse_g(g_u8RecData, 1,2, '"', '"' , networkoperator);  
              memset(temp,0,100);
              if(simselect == 1){
                sprintf(temp,"\r\nAT+QIREGAPP=\"%s\",\"\",\"\"\r\n\r\n",apn1);
              }else if(simselect == 2){
                sprintf(temp,"\r\nAT+QIREGAPP=\"%s\",\"\",\"\"\r\n\r\n",apn2);          
              }
            }else{
              sprintf(temp,"\r\nAT+QIREGAPP=\"%s\",\"\",\"\"\r\n\r\n","www");      
            }
            SendAT(temp, "Ready", "OK" , "ERROR",5);	
            SendAT("\r\nAT+QIACT\r\n\r\n", "Ready", "OK" , "ERROR",10);	
            if(timeoutflag != 0){
                SendAT("\r\nAT+CFUN=1,1\r\n\r\n", "ERROR", "OK" , "ERROR",1);
              
                PB15 = 0;
                manualdelay(1);
                PB15 = 1;
                manualdelay(100);      
                SendAT("\r\nAT\r\n", "ERROR", "OK" , "4010",10);
            }
          if(updatefirmware == 1){
            SendAT("\r\nAT+QIFGCNT=0\r\n\r\n", "OK", "NOT INSERTED" , "ERROR",5);
            SendAT("\r\nAT+QICSGP=1,\"www\"\r\n\r\n", "OK", "NOT INSERTED" , "ERROR",5);
            SendAT("\r\nAT+CGATT=1\r\n\r\n", "Ready", "OK" , "ERROR",10);	        
            SendAT("\r\nAT+QIACT\r\n\r\n", "Ready", "OK" , "ERROR",20);	    
            SendAT("\r\nAT+QFTPCLOSE\r\n\r\n", "+QFTPCLOSE:", "NOT INSERTED" , "ERROR",5);
            SendAT("\r\nAT+QFTPUSER=\"telecomftp\"\r\n\r\n", "OK", "NOT INSERTED" , "ERROR",5);
            SendAT("\r\nAT+QFTPPASS=\"test321\"\r\n\r\n", "OK", "NOT INSERTED" , "ERROR",5);
            SendAT("\r\nAT+QFTPOPEN=\"159.65.145.181\",45000\r\n\r\n", "+QFTPOPEN:", "NOT INSERTED" , "ERROR",5);
            SendAT("\r\nAT+QFTPCFG=4,\"/UFS\/fw.bin\"\r\n\r\n", "QFTPCFG:", "NOT INSERTED" , "ERROR",5);
            SendAT("\r\nAT+QFTPPATH=\"/\"\r\n\r\n", "QFTPPATH:", "NOT INSERTED" , "ERROR",5);      
            memset(temp,0,100);
            manualdelay(200);
            sprintf(temp,"\r\nAT+QFTPSIZE=\"\/files\/%s\"\r\n",filename);
            SendAT(temp, "+QFTPSIZE:-", "NOT INSERTED" , "ERROR",10);
            memset(firmwaresize,0,20);
            parse_g(g_u8RecData,1,4,':','\n',firmwaresize);
            remove_all_chars(firmwaresize,'\r','\n');
            memset(temp,0,100);  
            manualdelay(100);          
            sprintf(temp,"\r\nAT+QFTPGET=\"\/files\/%s\"\r\n",filename);
            SendAT(temp, firmwaresize, "+QFTPGET:-" , "ERROR",60);
            memset(temp,0,100);
            parse_g(g_u8RecData,1,4,':','\n',temp);
            remove_all_chars(temp,'\r','\n');
            
            if((!(mystrstr(temp,'-'))) && (!(mystrstr(temp,'-')))){
              if(strcmp(temp,firmwaresize) == 0){
                memset(messagedata,0,200);
                sprintf(messagedata,"Proceeding to upgrade version %s",filename);
                send_sms(sender_num, messagedata);                
                //updatefirmware = 0;
                SYS_UnlockReg();                          // Unlock Registers
                SYS->IPRSTC1 = 0x1; /* Reset MCU */
              }else{
                SendAT("\r\nAT+CFUN=1,1\r\n\r\n", "OK", "NOT INSERTED" , "ERROR",5);       
              }
            }
          }
        }
      }
    }

