mridulp-jft/telecom-gps/vtsOBD-2.0.0 - nuc130/KEIL/main.c
    memset(temp,0,100);
    sprintf(temp,"\r\nAT+QIOPEN=0,\"TCP\",\"%s\",\"%s\"\r\n\r\n",IP1,PORT1);
    SendAT(temp,"CONNECT","ERROR","FAIL",10);
    if((network == 1) && strstr(g_u8RecData,"CONNECT OK")){ 
      memset(temp,0,100);
      sprintf(temp,"\n\n$%s$%s$%s$%s$%s\n%c",vehicleregnum,imei,firmwareversion,frameformat,lastlocation,0x1A);
      loginpacket = 1;
      TCP_Send("\r\nAT+QISEND=0\r\n\r\n\r\n",temp,">","ERROR","SEND OK",10);	
      loginpacket = 0;
    }    
    memset(temp,0,100);
    sprintf(temp,"\r\nAT+QIOPEN=1,\"TCP\",\"%s\",\"%s\"\r\n\r\n",IP2,PORT2);
    SendAT(temp,"CONNECT","ERROR","FAIL",10);
    if((network == 1) && strstr(g_u8RecData,"CONNECT OK")){
      memset(temp,0,100);
      sprintf(temp,"$%s$%s$%s$%s$%s\n%c",vehicleregnum,imei,firmwareversion,frameformat,lastlocation,0x1A);
      loginpacket = 1;      
      TCP_Send("\r\nAT+QISEND=0\r\n\r\n\r\n",temp,">","ERROR","SEND OK",10);	
      loginpacket = 0;
    }   
    network=0;
    sendfs = 0; 
    sms_mc60();
    //send_sms("8287324005", "I am Rudra");
    TCP_Send("\r\nAT+QISEND=0\r\n\r\n\r\n",g_u8SendData,">","ERROR","SEND OK",10);	
    breaker = 0;
    if(sendfs==1){
      TCP_Send_ch("\r\nAT+QISEND\r\n\r\n",g_u8SendData,">","ERROR","SEND OK",5);	
    }
   
    if(network == 1){
      if(alertid == 10){
        memset(temp, 0, 100);
        sprintf(temp, "%s,%s,%s,%s,%s,%d,%s,%s,%s,%s,%s",imei, latitude, latdir, longitude, longdir,  fix, kmph, cellid , lac, gpsdate, gpstime);
        send_sms(emernum1, temp);
        send_sms(emernum2, temp);
      }
      notsentcounter++;
      sendalert();
      if(breaker == 1)SendAT_GPS("\r\n\r\nAT+QGNSSRD=\"NMEA/RMC\"\r\n\r\n\r\n", "MGPSSTATUS", "OK" , "ERROR",5);	
      if(notsentcounter >  10 && netselect == 1){
        notsentcounter = 0;
        networkswitch();
      }
      if(netselect == 1){
        SendAT("\r\nAT+QDSIM=0\r\n\r\n", "OK", "NOT INSERTED" , "ERROR",5);
      }else{
        SendAT("\r\nAT+QDSIM=1\r\n\r\n", "OK", "NOT INSERTED" , "ERROR",5); 
      }
      SendAT("\r\nAT+QICLOSE=0\r\n\r\n","CLOSE OK\r\n","ERROR","FAIL",10);	
      SendAT("\r\nAT+QICLOSE=1\r\n\r\n","CLOSE OK\r\n","ERROR","FAIL",10);	
      SendAT("\r\nAT+CFUN=0\r\n\r\n", "OK", "NOT INSERTED" , "ERROR",10);
      SendAT("\r\nAT+CFUN=1\r\n\r\n", "SMS Ready", "NOT INSERTED" , "ERROR",10);	
      wait = 0;
      do{
        sms_mc60(); 
      }while(wait < 2);
      Save_FS();
      SendAT("\r\nAT+QIDEACT\r\n\r\n", "OK", "DEACT OK" , "ERROR",10);
      SendAT("\r\nAT+QIMODE=0\r\n\r\n", "OK", "NOT INSERTED" , "ERROR",5);
      SendAT("\r\nAT+QIMUX?\r\n\r\n", "OK", "NOT INSERTED" , "ERROR",5);	
      SendAT("\r\nAT+QIMUX=1\r\n\r\n", "OK", "NOT INSERTED" , "ERROR",5);
      //manualdelay(200);
    }
    else{
      
        //if(fix == 0){
           SendAT("\r\nAT+QGEPOF=0,255\r\n\r\n", "OK", "NOT INSERTED" , "ERROR",5);
           //SendAT("\r\nAT+QGEPOF=1,255\r\n\r\n", "OK", "NOT INSERTED" , "ERROR",5);
               
        //}
      // Keep looping...
        if(interval_count > 10000)interval_count = 0;     
        if(interval_count_health > 10000)interval_count_health = 0;     
        if(tc > 10000)tc = 0;     
        if(tmr0sec > 10000)tmr0sec = 0;     
        if(tcpsendchtimer > 10000)tcpsendchtimer = 0;     
        if(i2ctimeout > 10000)i2ctimeout = 0;
        if(wetmr > 10000)wetmr = 0;
        if(ignition == 1){
          sleepinterval = sleepinterval_i1;
        }else{
          sleepinterval = sleepinterval_i0;      
        }
        // Live Data packet
        one = 1;
        while((interval_count_health < sleepinterval_health) && (interval_count < sleepinterval)){
//          if(sleepinterval > 30){
//            if(one == 1)
//              SendAT("\r\nAT+CFUN=0\r\n\r\n", "OK", "NOT INSERTED" , "ERROR",10);
//            
//            one = 0;
//          }
          dtr = 0;
          if(PB6 == 0){
            sms_mc60();
          }
        }
        one = 0;

    }
  }
}

__inline void networkswitch(){
 int timout = 0;
  _NETSWITCH:
  timout++;
  if(timout > 0){
    SendAT("\r\nAT+CFUN=1,1\r\n\r\n", "ERROR", "OK" , "ERROR",1);
    goto __RETURN;
  }
  SendAT("\r\nAT+CFUN=1,1\r\n\r\n", "ERROR", "OK" , "ERROR",1);
  
  PB15 = 0;
  manualdelay(1);
  PB15 = 1;
  manualdelay(50);      
  SendAT("\r\nAT\r\n", "+STKPCI", "NAK" , "NAK",40);
  manualdelay(50);
  SendAT("\r\nAT+COPS?\r\n", "OK", "NAK" , "NAK",40);
  // Set Menu 2500 is for Set Menu .
  SendAT("\r\nAT+STKTR=\"810301250082028281830100\"\r\n", "+STKPCI:", "NAK" , "NAK",40);
  manualdelay(50);
  // Check which SIM Network is Current.
  SendAT("\r\nAT+STKENV=\"D30782020181900101\"\r\n", "+STKPCI: 0", "NAK" , "NAK",40);
  manualdelay(50);
  memset(configdata,0,300);
  parse_g(g_u8RecData,3,4,'"','"',configdata);  
  hextoascii(configdata,strlen(configdata));
  // Switch to international .  You need to give command AT+STKTR="810301240082028281830100900101"  For National Switch
  if(strstr(DestArray,"National(ON)")){
    simselect = 1;
    SendAT("\r\nAT+STKTR=\"810301240082028281830100900102\"\r\n", "+STKPCI: 0", "NAK" , "NAK",40);   //international
  }else if(strstr(DestArray,"International(ON)")){
    simselect = 2;
    SendAT("\r\nAT+STKTR=\"810301240082028281830100900101\"\r\n", "+STKPCI: 0", "NAK" , "NAK",40);   //National     
  }else{
    goto _NETSWITCH;
  }      
  manualdelay(50);
  memset(configdata,0,300);
  parse_g(g_u8RecData,3,4,'"','"',configdata);
  hextoascii(configdata,strlen(configdata));
  if(simselect == 1){
    if(!strstr(DestArray,"ACTIVATE the INTERNATIONAL")){
      goto _NETSWITCH;
    }
  }      
  if(simselect == 2){
    if(!strstr(DestArray,"ACTIVATE the HOME")){
      goto _NETSWITCH;
    }
  }      
  // Give Confirmation '
  SendAT("\r\nAT+STKTR=\"810301218082028281830100\"\r\n", "+STKPCI: 0", "NAK" , "NAK",40);   //international
  manualdelay(50);
  memset(configdata,0,300);
  parse_g(g_u8RecData,3,4,'"','"',configdata);    
  hextoascii(configdata,strlen(configdata));
  if(!strstr(DestArray, "Refreshing.")){
    goto _NETSWITCH;
  }    
  // Here you need to reset the module you can use power reset
  SendAT("\r\nAT+CFUN=1,1\r\n\r\n", "ERROR", "OK" , "ERROR",1);

  PB15 = 0;
  manualdelay(1);
  PB15 = 1;
  manualdelay(100);      
  SendAT("\r\nAT\r\n", "+STKPCI: 0", "NAK" , "NAK",40);
  manualdelay(100);   
  __RETURN:
}

