mridulp-jft/telecom-gps/vtsOBD-2.0.0 - nuc130/KEIL/main.c
__inline void accgyroconfig(void){

  //I2C_Write(0x0D,0x01);
  //I2C_Write(0x0E,0x01);
//  I2C_Write(0x11,0x60);
  
  
  
  
  
}

__inline float binTwosComplementToSignedDecimal(int data,int significantBits) 
{
    int power = pow(2,significantBits-1);
    int sum = 0;
    int i;
    int j = 0;
    int signbit = 0;
    const size_t BITS = 8*sizeof(data);
    char binary[BITS+1];
    char newbin[BITS+1];
    memset(newbin,0,BITS+1);
    data -= 1;
    for(i=0; i<BITS; i++)
    {
      unsigned int mask = 1u << (BITS - 1 - i);
      binary[i] = (data & mask) ? '1' : '0';
    }
    binary[BITS] = '\0'; 
    i = 0;
    while(binary[i] != '1'){i++;}
    
    while(binary[i] != '\0'){
      newbin[j] = binary[i];
      i++;j++;
    }
    
    signbit = strlen(newbin);
    signbit-=1;
    for(i = 0; i <= signbit; i++){
    
      if(newbin[i] == '1'){
          if( i == 0){
            sum += pow(-2,signbit-i);
          }
          else{
            sum += pow(2, signbit-i);
          }
      }
   
    } 
    return sum;
}
 void readaccgyrodata(void){
 while(1){
//  I2C_Write(0x10,0x60);
//  I2C_Write(0x11,0x60);  
//  I2C_Write(0x20, 0x67);  
/*
    Let’s use FS ±2 g as an example sensitivity level.  As the range is -2 to +2, this would be a total of 4g.  Or 4,000 Milli-Gs.
    The output is 16 bits. 16 bits equals 65,535.   This means we can get 65,535 different readings for the range  between -2 and +2. (or -2,000 MilliGs and +2,000 MilliGs)
    4,000 MilliGs / 65,535 = 0.061
    Each time the LSB changes by one, the value changes by 0.061, which is the value highlighted in blue in the table above.
*/
//  STATUS_REG_A = I2C_Read(0x1E);
//  if(1)
   
    osSignalWait (0x0001, osWaitForever);  
   {
    ax = ((I2C_Read(0x29) << 8) | I2C_Read(0x28));
    ay = ((I2C_Read(0x2B) << 8) | I2C_Read(0x2A));
    az = ((I2C_Read(0x2D) << 8) | I2C_Read(0x2C));

    aax = binTwosComplementToSignedDecimal(ax, 16)*0.00061;
    aay = binTwosComplementToSignedDecimal(ay, 16)*0.00061;
    aaz = binTwosComplementToSignedDecimal(az, 16)*0.00061;

    
    gx = ((I2C_Read(0x23) << 8) | I2C_Read(0x22));
    gy = ((I2C_Read(0x25) << 8) | I2C_Read(0x24));
    gz = ((I2C_Read(0x27) << 8) | I2C_Read(0x26));
   
    ggx = binTwosComplementToSignedDecimal(gx, 16)*0.00763;
    ggy = binTwosComplementToSignedDecimal(gy, 16)*0.00763;
    ggz = binTwosComplementToSignedDecimal(gz, 16)*0.00763;
    
    
  }osSignalClear (tid_Thread_accgyro_READ, 0x0001);
  //osDelay(100);
 }
 
}

__inline uint8_t I2C_Write(uint16_t u16Address, uint8_t u8Data)
{
  u32Status=0;
  I2C_SET_CONTROL_REG(I2C0, I2C_I2CON_STA );
  i2ctimeout = 0;
  while((u32Status != 0x08) && (i2ctimeout == 0)){
    u32Status = I2C_GET_STATUS(I2C0);   
  }    //ST ack
  I2C_SET_DATA(I2C0, ((g_u8DeviceAddr << 1)));   
  I2C_SET_CONTROL_REG(I2C0, I2C_I2CON_SI);
  i2ctimeout = 0;while((u32Status != 0x18) && (i2ctimeout == 0)){
    u32Status = I2C_GET_STATUS(I2C0);   
  }    //SAD+W ack
  I2C_SET_DATA(I2C0, ((u16Address) ));   
  I2C_SET_CONTROL_REG(I2C0, I2C_I2CON_SI);  
  i2ctimeout = 0;while((u32Status != 0x28) && (i2ctimeout == 0)){
    u32Status = I2C_GET_STATUS(I2C0);   
  }    //SAK 
  u32Status = 0;
  I2C_SET_DATA(I2C0, ((u8Data)));  
  I2C_SET_CONTROL_REG(I2C0, I2C_I2CON_SI);  
  i2ctimeout = 0;while((u32Status != 0x28) && (i2ctimeout == 0)){
    u32Status = I2C_GET_STATUS(I2C0);   
  }    
  I2C_SET_CONTROL_REG(I2C0, I2C_I2CON_STO | I2C_I2CON_SI);  
  return 0;
}

/**
 * @brief       This function do the I2C data reading from EEPROM device.
 *
 * @param[in]   u16Address  An address of EEPROM that will be read.
 *
 * @return      The data be read out.
 */
__inline uint8_t I2C_Read(uint16_t u16Address){
  I2C_SET_CONTROL_REG(I2C0, I2C_I2CON_STA );
  i2ctimeout = 0;
  //osDelay(10);
  u32Status = I2C_GET_STATUS(I2C0);
  while((u32Status != 0x08) && (i2ctimeout == 0)){
    u32Status = I2C_GET_STATUS(I2C0);    
  }
  I2C_SET_DATA(I2C0, ((g_u8DeviceAddr << 1)| (0x00)));   
  I2C_SET_CONTROL_REG(I2C0, I2C_I2CON_SI);
  i2ctimeout = 0;
  while((u32Status != 0x18) && (i2ctimeout == 0)){
    u32Status = I2C_GET_STATUS(I2C0);
  }
  //osDelay(10);
  
  I2C_SET_DATA(I2C0, ((u16Address)));   
  I2C_SET_CONTROL_REG(I2C0, I2C_I2CON_SI);  
  i2ctimeout = 0;
  while((u32Status != 0x28) && (i2ctimeout == 0)){
    u32Status = I2C_GET_STATUS(I2C0);    
  }
  //osDelay(10);
  
  I2C_SET_CONTROL_REG(I2C0, I2C_I2CON_STA | I2C_I2CON_SI);
  i2ctimeout = 0;
  while((u32Status != 0x10) && (i2ctimeout == 0)){
    u32Status = I2C_GET_STATUS(I2C0);
  }    
  //osDelay(10);

  I2C_SET_DATA(I2C0, ((g_u8DeviceAddr << 1) | (0x01) ));   
  I2C_SET_CONTROL_REG(I2C0, I2C_I2CON_SI);
  i2ctimeout = 0;
  while((u32Status != 0x40) && (i2ctimeout == 0)){
    u32Status = I2C_GET_STATUS(I2C0);    
  }
  //osDelay(10);

  I2C_SET_CONTROL_REG(I2C0, I2C_I2CON_SI);  
  i2ctimeout = 0;
  while((u32Status != 0x58) && (i2ctimeout == 0)){
    u32Status = I2C_GET_STATUS(I2C0);    
  }
  //osDelay(1);

  g_u8RxData = I2C_GET_DATA(I2C0);
  I2C_SET_CONTROL_REG(I2C0, I2C_I2CON_STO | I2C_I2CON_SI);  
  return g_u8RxData;
}




__inline void sms_mc60(void){
  char epolatlong[30] = {0};
  int smsreq=0;
  int del = 0;
  if(ring = 1){
	//osDelay(100);
  manualdelay(10);
  SendAT("\r\nAT+CMGF=1\r\n\r\n", "Ready", "OK" , "ERROR",10);	
  SendAT("\r\nAT+CMGR=1,0\r\n\r\n", "NAK", "NSK" , "ERROR",2);
    if(!strstr(g_u8RecData, "+CMGR:")){del = 1;}
  memset(sender_num,0,15);
  parse_g(g_u8RecData,3,4,'"','"',sender_num);    
  memset(messagedata,0,200);
    if(strstr(g_u8RecData,"SETIP1")){
      parameterupgrade = 1;
      memset(IP1,0,50);
      memset(PORT1,0,10);
      parse_g(g_u8RecData,9,10,'"','"',IP1);
      parse_g(g_u8RecData,11,12,'"','"',PORT1);
      saveipconfigurations();
      sprintf(messagedata,"IP1 %s,PORT1 %s configured and saved",IP1,PORT1);
      send_sms(sender_num, messagedata);
    }  
    else if(strstr(g_u8RecData,"SETIP2")){
      parameterupgrade = 1;
      memset(IP2,0,50);
      memset(PORT2,0,10);
      parse_g(g_u8RecData,9,10,'"','"',IP2);
      parse_g(g_u8RecData,11,12,'"','"',PORT2);    
      saveipconfigurations();
      sprintf(messagedata,"IP2 %s,PORT2 %s configured and saved",IP2,PORT2);
      send_sms(sender_num, messagedata); 
    }
    else if(strstr(g_u8RecData,"RESET")){
      
      SendAT("\r\nAT+CMGD=1,4\r\n\r\n", "OK", "ERROR", "7103", 10);
      SendAT("\r\nAT+CFUN=1,1\r\n\r\n", "ERROR", "OK" , "ERROR",1);

      PB15 = 0;
      manualdelay(1);
      PB15 = 1;
      manualdelay(50);       
      
      SYS_UnlockReg();                          // Unlock Registers
      SYS->IPRSTC1 = 0x1; /* Reset MCU */      
    }
    else if(strstr(g_u8RecData,"SETAPN")){  
      parameterupgrade = 1;
      memset(apn1,0,20);
      memset(apn2,0,20);
      parse_g(g_u8RecData,9,10,'"','"',apn1);
      parse_g(g_u8RecData,11,12,'"','"',apn2);
      saveipconfigurations();
      sprintf(messagedata,"APN \"%s\",\"%s\" configured and saved",apn1,apn2);
      send_sms(sender_num, messagedata);      

