mridulp-jft/telecom-gps/vtsOBD-2.0.0 - nuc130/KEIL/main.c
    }
    else if(strstr(g_u8RecData,"SETSLEEPTIME")){   
      parameterupgrade = 1;
      memset(temp,0,100);
      parse_g(g_u8RecData,9,10,'"','"',temp);
      sleepinterval_i1 = atoi(temp);
      memset(temp,0,100);
      parse_g(g_u8RecData,11,12,'"','"',temp);
      sleepinterval_i0 = atoi(temp);      
      saveipconfigurations();   
      sprintf(messagedata,"IgnON:%d IgnOFF:%d freq. configured and saved",sleepinterval_i1,sleepinterval_i0);
      send_sms(sender_num, messagedata);        
    }
    else if(strstr(g_u8RecData,"SETHEALTHINTERVAL")){   
      parameterupgrade = 1;
      memset(temp,0,100);
      parse_g(g_u8RecData,9,10,'"','"',temp);
      sleepinterval_health = atoi(temp);
      saveipconfigurations();      
      sprintf(messagedata,"Health freq %d configured and saved",sleepinterval_health);
      send_sms(sender_num, messagedata);         
    }   
    else if(strstr(g_u8RecData,"SETEMERGENCYTIME")){   
      parameterupgrade = 1;
      memset(temp,0,100);
      parse_g(g_u8RecData,9,10,'"','"',temp);
      wakeinterval_emer = atoi(temp);
      saveipconfigurations();      
      sprintf(messagedata,"Emergency interval %d configured and saved",wakeinterval_emer);
      send_sms(sender_num, messagedata);         
    }      
    else if(strstr(g_u8RecData,"SETOVERSPEEDLIMIT")){  
      parameterupgrade = 1;
      memset(temp,0,100);
      parse_g(g_u8RecData,9,10,'"','"',temp);
      overspeed = atof(temp);
      saveipconfigurations();  
      sprintf(messagedata,"Overspeed alert on:%.2f km/h configured and saved",overspeed);
      send_sms(sender_num, messagedata);            
    }
    else if(strstr(g_u8RecData,"SETHARSHACCTHRESH")){
      parameterupgrade = 1;
      memset(temp,0,100);
      parse_g(g_u8RecData,9,10,'"','"',temp);
      harshacc = atof(temp);
      saveipconfigurations();  
      sprintf(messagedata,"Harsh Acc alert on:%.2f m/s2 configured and saved",harshacc);
      send_sms(sender_num, messagedata);       
    }
    else if(strstr(g_u8RecData,"SETHARSHBRAKETHRESH")){
      parameterupgrade = 1;
      memset(temp,0,100);
      parse_g(g_u8RecData,9,10,'"','"',temp);
      harshbrake = atof(temp);
      saveipconfigurations(); 
      sprintf(messagedata,"Harsh brake alert on:%.2f m/s2 configured and saved",harshbrake);
      send_sms(sender_num, messagedata);        
    }
    else if(strstr(g_u8RecData,"SETRASHTURNTHRESH")){
      parameterupgrade = 1;
      memset(temp,0,100);
      parse_g(g_u8RecData,9,10,'"','"',temp);
      rashturn = atof(temp);
      saveipconfigurations(); 
      sprintf(messagedata,"Rash turn alert on:%.2f rad/s configured and saved",rashturn);
      send_sms(sender_num, messagedata);       
    } 
    else if(strstr(g_u8RecData,"SETLICPLATE")){
      parameterupgrade = 1;
      memset(vehicleregnum,0,15);
      parse_g(g_u8RecData,9,10,'"','"',vehicleregnum);
      saveipconfigurations();    
      sprintf(messagedata,"Licence plate \"%s\" configured and saved",vehicleregnum);
      send_sms(sender_num, messagedata);         
    } 
    else if(strstr(g_u8RecData,"FOTA")){
      memset(filename,0,10);
      parse_g(g_u8RecData,9,10,'"','"',filename);  
      updatefirmware =1;

    }       
    else if(strstr(g_u8RecData,"DEBUG")){
      smsreq = 6;
      memset(temp,0,100);
      parse_g(g_u8RecData,1,1,',',',',temp); 
      strcat(temp,"\r\n\r\n");
      memset(ph_num,0,15);
      parse_g(g_u8RecData,3,4,'"','"',ph_num);  
    }       
    else if(strstr(g_u8RecData,"SETBATTHRESH")){
      parameterupgrade = 1;
      memset(temp,0,100);
      parse_g(g_u8RecData,9,10,'"','"',temp);  
      batteryvoltagethreshold = atof(temp); 
      saveipconfigurations();  
      sprintf(messagedata,"Battery Alert below \"%.1f\" volts configured and saved",batteryvoltagethreshold);
      send_sms(sender_num, messagedata);          
    }
    else if(strstr(g_u8RecData,"SETSIMSWITCH")){
      parameterupgrade = 1;
      memset(temp,0,100);
      //parse_g(g_u8RecData,9,10,'"','"',temp);  
      //netselect = atoi(temp);
      networkswitch();
      send_sms(sender_num, imei);  
      manualdelay(500);
    }     
    else if(strstr(g_u8RecData,"GETIMEI")){
      send_sms(sender_num, imei);
    }
    else if(strstr(g_u8RecData,"EPO")){
      memset(epolatlong,0,30);
      parse_g(g_u8RecData,9,10,'"','"',epolatlong);        
      SendAT("\r\nAT+CREG?;+CGREG?\r\n\r\n", "OK", "ERROR", "7103", 10);
      memset(cregresp,0,10);
      parse_g(g_u8RecData, 1, 1, ',', 'O' , cregresp);
      remove_all_chars(cregresp,'\r','\n');      
      if(strstr(g_u8RecData,"1") || strstr(g_u8RecData, "5"))
        {
          memset(temp,0,100);
          sprintf(temp,"\r\nAT+QGREFLOC=%s\r\n\r\n",epolatlong);
          SendAT(temp, "OK", "ERROR", "7103", 10);
          SendAT("\r\nAT+QGNSSEPO=1\r\n\r\n", "OK", "ERROR", "7103", 10);
          SendAT("\r\nAT+QGEPOAID=1\r\n\r\n", "OK", "ERROR", "7103", 10);
      }
    }        
     else if(strstr(g_u8RecData,"ANTENNA")){
      memset(epolatlong,0,30);
      parse_g(g_u8RecData,9,10,'"','"',epolatlong);        
      if(strstr(epolatlong,"EXT")){
        antennaselect = 0;
      }else if(strstr(epolatlong,"INT")){
        antennaselect = 1;
      }        
      saveipconfigurations(); 
    }       
     else if(strstr(g_u8RecData,"DEFAULT")){
        memset(IP1,0,50);
        strcat(IP1,"104.236.203.4");
        memset(PORT1,0,10);
        strcat(PORT1,"5557");
        memset(PORT2,0,10);
        memset(IP2,0,50);
        strcat(IP1,"104.236.203.4");
        strcat(PORT1,"5557");    
        memset(vehicleregnum,0,15);
        strcat(vehicleregnum,"BR15AN1526");

        memset(apn1,0,20);
        memset(apn2,0,20);
        strcat(apn1,"airtelgprs.com");
        strcat(apn2,"internet");
        sleepinterval_i1 = 30;
        sleepinterval_i0 = 30;

        saveipconfigurations(); 
    } 
     else if(strstr(g_u8RecData,"SETVENDORID")){
      memset(temp,0,100);
      parse_g(g_u8RecData,9,10,'"','"',temp);        
      
      saveipconfigurations(); 
    }      
  ring=0;  
  if(del == 0){
    manualdelay(100);
    SendAT("\r\nAT+CMGD=1,4\r\n\r\n", "OK", "ERROR", "7103", 10);
    }
  }
}

__inline void send_sms(char* num, char* content){
  SendAT("\r\nAT+CSCS=\"GSM\"\r\n\r\n", "OK", "ERROR", "7103", 10);
  SendAT("\r\nAT+CSCA?\r\n\r\n", "OK", "ERROR", "7103", 10);
  SendAT("\r\nAT+CMGF=1\r\n\r\n", "OK", "ERROR", "7103", 10);  
  memset(temp,0,100);
  sprintf(temp,"AT+CMGS=\"%s\"\r\n",num);
  SendAT(temp, "ERROR", "ERROR", ">", 10);
  tmr0sec=0;
  g_u8RecDataptr=0;
  memset(g_u8RecData,0,RXBUFSIZE);
  clear();
  printf(content);
  printf("%c",0x1A); 
  printf("%c",0x1A); 
  printf("%c",0x1A); 
  do{
  g_u8RecData[0] = '\r';
	}while(!(strstr(g_u8RecData, "OK") || strstr(g_u8RecData, "ERROR") || strstr(g_u8RecData, "CME") ||((tmr0sec >= 5))));	 //!(r1 || r2 || r3 ||
  //SendAT("\r\nAT+CMGD=1,4\r\n\r\n", "OK", "ERROR", "7103", 10);

