mridulp-jft/telecom-gps/vtsOBD-2.0.0 - nuc130/KEIL/main.c
}

void smsrequest(int _case, char* arg1, char* arg2){
  char *sn = sender_num+3;
  int go = 0;
  switch(_case){
    case 1:
      break;
    case 2:
      break;
    case 3:
      break;
    case 4:
      break;
    case 5:
      break;
    case 6:
      break;
    case 7:
      break;
    case 8:
      break;
    case 9:
      break;
    case 10:
      break;
    default:
      break;
    
  }
}


int saveipconfigurations(void){
  int retry = 1;
  int len;
  while(retry == 1){
    if((strlen(IP1) < 4) || (strlen(IP2) < 4)|| (strlen(PORT1) < 1) || (strlen(PORT2) < 1) || (strlen(vehicleregnum) < 4)){

      //reboot
      SYS_UnlockReg();                          // Unlock Registers
      SYS->IPRSTC1 = 0x1; /* Reset MCU */
    
      memset(IP1,0,50);
      memset(IP2,0,50);
      memset(PORT1,0,7);
      memset(PORT2,0,7);
      memset(vehicleregnum,0,15);
      strcat(IP1, "203.129.207.124");
      strcat(IP2, "104.236.203.4");
      strcat(PORT1, "1025");
      strcat(PORT2, "5557");
      strcat(vehicleregnum, "DL1PC5498");
      send_sms("8287324005", "bhasad hai");
      sleepinterval_i1 = 30;
      sleepinterval_i0 = 30;
      sleepinterval_health = 900;
  }    
    
    
    memset(fileinstance,0,20);
    SendAT("\r\nAT+QFDEL=\"IPCONFIG.TXT\"\r\n", "ERROR", "OK" , "4010",10);
    while(strstr(g_u8RecData,"ERROR")){
      SendAT("\r\nAT+CFUN=1,1\r\n\r\n", "ERROR", "OK" , "ERROR",1);
      PB15 = 0;
        manualdelay(1);
      PB15 = 1;
      manualdelay(100);      
      SendAT("\r\nAT\r\n", "ERROR", "OK" , "4010",10);
      manualdelay(200);
      SendAT("\r\nAT\r\n", "ERROR", "CFUN: " , "4010",10);
      SendAT("\r\nAT+QFLST=\"*\"\r\n", "ERROR", "OK" , "4010",10);
      if(strstr(g_u8RecData, "IPCONFIG.TXT")){
        SendAT("\r\nAT+QFDEL=\"IPCONFIG.TXT\"\r\n", "ERROR", "OK" , "4010",10);
        manualdelay(100);
      }else{
        break;
      }
      if(!strstr(g_u8RecData,"ERROR")){
        break;
      }        
    }        
    
    SendAT("\r\nAT+QFOPEN=\"IPCONFIG.TXT\",0\r\n", "ERROR", "OK" , "ERROR",10);
    if(strstr(g_u8RecData,"ERROR")){
      SendAT("\r\nAT+CFUN=1,1\r\n\r\n", "ERROR", "OK" , "ERROR",1);
      PB15 = 0;
        manualdelay(1);
      PB15 = 1;
      manualdelay(100);      
      SendAT("\r\nAT\r\n", "ERROR", "OK" , "4010",10);
      manualdelay(20);
      SendAT("\r\nAT\r\n", "ERROR", "CFUN: " , "4010",10);
      SendAT("\r\nAT+QFOPEN=\"IPCONFIG.TXT\",0\r\n", "ERROR", "OK" , "ERROR",10);
      //manualdelay(10);
    
    }      
      parse_g(g_u8RecData, 1, 1, ' ', 'K' , fileinstance);
      remove_all_chars(fileinstance, '\r', '\n'); 
      remove_all_chars(fileinstance, 'O', 'K');   
    
    //seek to the origin 
    memset(temp,0,100);
    sprintf(temp, "AT+QFSEEK=%s,0,0\r\n\r\n", fileinstance);
    SendAT(temp, "CONNECT", "OK" , "ERROR",10);	  

    memset(configdata,0,300);
    sprintf(configdata,"|IP1|%s|P1|%s|IP2|%s|P2|%s|F_R_P|%.0f|F_W_P|%.0f|I1_NR|%d|L_PLT|%s|APN1|%s|OS|%.1f|HA|%.1f|HB|%.1f|RT|%.1f|I_HLT|%d|I0_NR|%d|I_EM|%d|B_V_T|%.1f|net|%d|APN2|%s|ant|%d|\n",\
                         IP1,PORT1,IP2,PORT2,readpt,pt,sleepinterval_i1,vehicleregnum,apn1,overspeed,harshacc,harshbrake,rashturn,sleepinterval_health,sleepinterval_i0,wakeinterval_emer,batteryvoltagethreshold,netselect,apn2,antennaselect);
    retry = 0;    
    len = strlen(configdata);
    
    memset(temp,0,100);
    sprintf(temp, "AT+QFWRITE=%s,%d\r\n\r\n", fileinstance,len);
    SendAT(temp, "CONNECT", "OK" , "ERROR",10);	    
    if(strstr(g_u8RecData, "CONNECT")){
      SendAT(configdata, "QFWRITE", "OK" , "ERROR",10);	 
      retry = 0;
    }
    memset(temp,0,100);
    sprintf(temp,"\r\nAT+QFCLOSE=%s\r\n\r\n",fileinstance);
    SendAT(temp, "+CME ERROR", "OK" , "ERROR",10);
    manualdelay(10);
  }
SendAT("\r\nAT+QICLOSE=0\r\n\r\n","CLOSE OK\r\n","ERROR","FAIL",10);	
SendAT("\r\nAT+QICLOSE=1\r\n\r\n","CLOSE OK\r\n","ERROR","FAIL",10);	

return 0;
}
__inline void readipconfigurations(void){
  int retry = 1;
  int len;
  char pt_c[10] = 0;
  char readpt_c[10] = 0;
  char interval_c[10] = 0;
  __READCONFIG:
  do{    
    manualdelay(10);
    memset(fileinstance,0,20);
    SendAT("\r\nAT+QFOPEN=\"IPCONFIG.TXT\",0\r\n", "ERROR", "OK\r\n" , "ERROR",10);	
    if(!strstr(g_u8RecData, "OK")){
      SendAT("\r\nAT+CFUN=1,1\r\n\r\n", "ERROR", "OK" , "ERROR",1);
      PB15 = 0;
        manualdelay(1);
      PB15 = 1;
      manualdelay(100);      
      SendAT("\r\nAT\r\n", "ERROR", "OK" , "4010",10);
      manualdelay(20);
      SendAT("\r\nAT\r\n", "ERROR", "CFUN: " , "4010",10);
      SendAT("\r\nAT+QFOPEN=\"IPCONFIG.TXT\",0\r\n", "ERROR", "OK" , "ERROR",10);
      manualdelay(10);
    }
    parse_g(g_u8RecData, 1, 1, ' ', 'K' , fileinstance);
    remove_all_chars(fileinstance, '\r', '\n'); 
    remove_all_chars(fileinstance, 'O', 'K'); 
    remove_all_alpha(fileinstance, 'O', 'K'); 
    if(strlen(fileinstance)<1)retry = 1;
    else{
      //seek to the origin 
      manualdelay(10);
      memset(temp,0,100);
      sprintf(temp, "AT+QFSEEK=%s,0,0\r\n\r\n", fileinstance);
      SendAT(temp, "CONNECT", "OK" , "ERROR",10);	    
      memset(temp,0,100);
      manualdelay(10);
      sprintf(temp, "AT+QFREAD=%s\r\n\r\n", fileinstance);
      SendAT(temp, "OK", "OK" , "ERROR",10);	    
      if(!strstr(g_u8RecData, "CONNECT")){
        goto __READCONFIG;
      }
      memset(IP1,0,50);
      memset(IP2,0,50);
      memset(PORT1,0,7);
      memset(PORT2,0,7);
      memset(pt_c,0,10);
      memset(readpt_c,0,10);
      memset(interval_c,0,10);
      memset(apn1,0,20);
      memset(apn2,0,20);
      parse_g(g_u8RecData, 2,3,'|','|', IP1);
      parse_g(g_u8RecData, 4,5,'|','|', PORT1);
      parse_g(g_u8RecData, 6,7,'|','|', IP2);
      parse_g(g_u8RecData, 8,9,'|','|', PORT2);
      parse_g(g_u8RecData, 10,11,'|','|', readpt_c);
      parse_g(g_u8RecData, 12,13,'|','|', pt_c);
      parse_g(g_u8RecData, 14,15,'|','|', interval_c);
      parse_g(g_u8RecData, 16,17,'|','|', vehicleregnum);      
      parse_g(g_u8RecData, 18,19,'|','|', apn1);   
      memset(temp,0,100);
      parse_g(g_u8RecData, 20,21,'|','|', temp);
      overspeed = atof(temp);
      memset(temp,0,100);
      parse_g(g_u8RecData, 22,23,'|','|', temp);
      harshacc = atof(temp);
      memset(temp,0,100);
      parse_g(g_u8RecData, 24,25,'|','|', temp);
      harshbrake = atof(temp);
      memset(temp,0,100);
      parse_g(g_u8RecData, 26,27,'|','|', temp);
      rashturn = atof(temp);
      memset(temp,0,100);
      parse_g(g_u8RecData, 28,29,'|','|', temp);
      sleepinterval_health = atoi(temp);
      memset(temp,0,100);
      parse_g(g_u8RecData, 30,31,'|','|', temp);
      sleepinterval_i0 = atoi(temp);   

