mridulp-jft/telecom-gps/vtsOBD-2.0.0 - nuc130/KEIL/main.c
      memset(temp,0,100);
      parse_g(g_u8RecData, 32,33,'|','|', temp);
      wakeinterval_emer=atoi(temp);
      
      memset(temp,0,100);
      parse_g(g_u8RecData, 34,35,'|','|', temp);
      batteryvoltagethreshold=atof(temp);   

      memset(temp,0,100);
      parse_g(g_u8RecData, 36,37,'|','|', temp);
      netselect=atoi(temp);   
      parse_g(g_u8RecData, 38,39,'|','|', apn2);   
      memset(temp,0,100);
      parse_g(g_u8RecData, 40,41,'|','|', temp);      
      antennaselect = atoi(temp);
      
      PB8 = antennaselect;
      pt = atof(pt_c);
      readpt = atof(readpt_c);
      sleepinterval_i1 = atoi(interval_c); 
      memset(temp,0,100);
      sprintf(temp,"\r\nAT+QFCLOSE=%s\r\n\r\n",fileinstance);
      SendAT(temp, "+CME ERROR", "OK" , "ERROR",10);
      retry = 0;
    }
  }while(retry);
}


__inline void OBD_GET_PID(){
//  send_OBD("ATZ\r","HELLO","NODATA",">",5);
//  send_OBD("ATE1\r","HELLO","NODATA",">",5);
//  send_OBD("ATL1\r","HELLO","NODATA",">",5);
//  send_OBD("ATSP0\r","HELLO","NODATA",">",5);
//  send_OBD("ATDP\r","HELLO","NODATA",">",5);
//  send_OBD("ATRV\r","HELLO","NODATA",">",5);
//  send_OBD("0100\r","HELLO","NODATA",">",5);
//  send_OBD("0101\r","HELLO","NODATA",">",5);
//  send_OBD("010C\r","HELLO","NODATA",">",5);
//  send_OBD("010D\r","HELLO","NODATA",">",5);
//  send_OBD("0120\r","HELLO","NODATA",">",5);
//  memset(suppportedpid, 0, sizeof(char)*200*7);
//  //   if(!(strstr(g_u8OBDRecData,"UNABLE") || strstr(g_u8OBDRecData,"NO DATA"))){	
//  pidcounter=0;
//  supportedpid("0100\r\n");
//  supportedpid("0120\r\n");
//  supportedpid("0140\r\n");
//  supportedpid("0160\r\n");
//  supportedpid("0180\r\n");
//  supportedpid("01A0\r\n");
//  supportedpid("01C0\r\n");
//  supportedpid("050100\r\n");
//  supportedpid("0900\r\n");	
}
__inline void SYS_Init(void)
{
    /*---------------------------------------------------------------------------------------------------------*/
    /* Init System Clock                                                                                       */
    /*---------------------------------------------------------------------------------------------------------*/


    /* Enable Internal RC 22.1184MHz clock */
    CLK_EnableXtalRC(CLK_PWRCON_OSC22M_EN_Msk);

    /* Waiting for Internal RC clock ready */
    CLK_WaitClockReady(CLK_CLKSTATUS_OSC22M_STB_Msk);

    /* Switch HCLK clock source to Internal RC and HCLK source divide 1 */
    CLK_SetHCLK(CLK_CLKSEL0_HCLK_S_HIRC, CLK_CLKDIV_HCLK(1));

    /* Enable external XTAL 12MHz clock */
    CLK_EnableXtalRC(CLK_PWRCON_XTL12M_EN_Msk);

    /* Waiting for external XTAL clock ready */
    CLK_WaitClockReady(CLK_CLKSTATUS_XTL12M_STB_Msk);

    /* Set core clock as PLL_CLOCK from PLL */
    CLK_SetCoreClock(PLL_CLOCK);

    /* Enable UART module clock */
    CLK_EnableModuleClock(UART0_MODULE);

    /* Select UART module clock source */
    CLK_SetModuleClock(UART0_MODULE, CLK_CLKSEL1_UART_S_HIRC, CLK_CLKDIV_UART(1));
    
    /* Enable UART module clock */
    CLK_EnableModuleClock(UART1_MODULE);

    /* Select UART module clock source */
    CLK_SetModuleClock(UART1_MODULE, CLK_CLKSEL1_UART_S_HIRC, CLK_CLKDIV_UART(1));
    
    /* Enable UART module clock */
    CLK_EnableModuleClock(UART2_MODULE);

    /* Select UART module clock source */
    CLK_SetModuleClock(UART2_MODULE, CLK_CLKSEL1_UART_S_HIRC, CLK_CLKDIV_UART(1));

    /* Enable I2C0 module clock */
    CLK_EnableModuleClock(I2C0_MODULE);
    
    /* Set GPA multi-function pins for I2C0 SDA and SCL */
    SYS->GPA_MFP &= ~(SYS_GPA_MFP_PA8_Msk | SYS_GPA_MFP_PA9_Msk);
    SYS->GPA_MFP |= SYS_GPA_MFP_PA8_I2C0_SDA | SYS_GPA_MFP_PA9_I2C0_SCL;

    CLK_EnableModuleClock(WWDT_MODULE);         
    /* Select WWDT module clock source */
    CLK_SetModuleClock(WWDT_MODULE, CLK_CLKSEL2_WWDT_S_HCLK_DIV2048, NULL);    
    /* Select ADC module clock source */
    CLK_SetModuleClock(ADC_MODULE, CLK_CLKSEL1_ADC_S_HIRC, CLK_CLKDIV_ADC(7));
    CLK_EnableModuleClock(TMR0_MODULE);   
    CLK_SetModuleClock(TMR0_MODULE, CLK_CLKSEL1_TMR0_S_HXT, NULL);
   
    /* Reset I2C0 */
    SYS->IPRSTC2 |=  SYS_IPRSTC2_I2C0_RST_Msk;
    SYS->IPRSTC2 &= ~SYS_IPRSTC2_I2C0_RST_Msk;

    /* Enable I2C0 Controller */
    I2C0->I2CON |= I2C_I2CON_ENS1_Msk;

    /* I2C0 bus clock 100K divider setting, I2CLK = PCLK/(100K*4)-1 */
    u32BusClock = 100000;
    I2C0->I2CLK = (uint32_t)(((SystemCoreClock * 10) / (u32BusClock * 4) + 5) / 10 - 1); /* Compute proper divider for I2C clock */

    /* Get I2C0 Bus Clock */
    //printf("I2C clock %d Hz\n", (SystemCoreClock / (((I2C0->I2CLK) + 1) << 2)));

    /* Set I2C0 4 Slave Addresses */
    /* Slave Address : 0x15 */
    I2C0->I2CADDR0 = (I2C0->I2CADDR0 & ~I2C_I2CADDR_I2CADDR_Msk) | (0x15 << I2C_I2CADDR_I2CADDR_Pos);
    /* Slave Address : 0x35 */
    I2C0->I2CADDR1 = (I2C0->I2CADDR1 & ~I2C_I2CADDR_I2CADDR_Msk) | (0x35 << I2C_I2CADDR_I2CADDR_Pos);
    /* Slave Address : 0x55 */
    I2C0->I2CADDR2 = (I2C0->I2CADDR2 & ~I2C_I2CADDR_I2CADDR_Msk) | (0x55 << I2C_I2CADDR_I2CADDR_Pos);
    /* Slave Address : 0x75 */
    I2C0->I2CADDR3 = (I2C0->I2CADDR3 & ~I2C_I2CADDR_I2CADDR_Msk) | (0x75 << I2C_I2CADDR_I2CADDR_Pos);

    CLK_EnableModuleClock(ADC_MODULE);
    
    CLK_SetModuleClock(ADC_MODULE, CLK_CLKSEL1_ADC_S_HIRC, CLK_CLKDIV_ADC(7));


    /*---------------------------------------------------------------------------------------------------------*/
    /* Init I/O Multi-function                                                                                 */
    /*---------------------------------------------------------------------------------------------------------*/

    /* Set GPB multi-function pins for UART0 RXD and TXD */
    SYS->GPB_MFP &= ~(SYS_GPB_MFP_PB0_Msk | SYS_GPB_MFP_PB1_Msk);
    SYS->GPB_MFP |= SYS_GPB_MFP_PB0_UART0_RXD | SYS_GPB_MFP_PB1_UART0_TXD;
    
    /* Set GPB multi-function pins for UART1 RXD and TXD */
    SYS->GPB_MFP &= ~(SYS_GPB_MFP_PB4_Msk | SYS_GPB_MFP_PB5_Msk);
    SYS->GPB_MFP |= SYS_GPB_MFP_PB4_UART1_RXD | SYS_GPB_MFP_PB5_UART1_TXD;

    /* Set GPB multi-function pins for UART2 RXD and TXD */
    SYS->GPD_MFP &= ~(SYS_GPD_MFP_PD14_Msk | SYS_GPD_MFP_PD15_Msk);
    SYS->GPD_MFP |= SYS_GPD_MFP_PD14_UART2_RXD | SYS_GPD_MFP_PD15_UART2_TXD;

    /* Configure the GPA0 - GPA7   ADC analog input pins */
    SYS->GPA_MFP &= ~(SYS_GPA_MFP_PA0_Msk | SYS_GPA_MFP_PA1_Msk | SYS_GPA_MFP_PA2_Msk | SYS_GPA_MFP_PA3_Msk | SYS_GPA_MFP_PA4_Msk | SYS_GPA_MFP_PA5_Msk | SYS_GPA_MFP_PA6_Msk);
    SYS->GPA_MFP |= SYS_GPA_MFP_PA0_ADC0 | SYS_GPA_MFP_PA1_ADC1 | SYS_GPA_MFP_PA2_ADC2 | SYS_GPA_MFP_PA3_ADC3 | SYS_GPA_MFP_PA4_ADC4 | SYS_GPA_MFP_PA5_ADC5 | SYS_GPA_MFP_PA6_ADC6 ;
    SYS->ALT_MFP1 = 0;
    
    GPIO_SET_DEBOUNCE_TIME(GPIO_DBCLKSRC_HCLK, GPIO_DBCLKSEL_32768);
    GPIO_ENABLE_DEBOUNCE(PB, BIT6 | BIT9 | BIT10 | BIT13 | BIT8 | BIT15);
    GPIO_ENABLE_DEBOUNCE(PA, BIT14 | BIT15 | BIT12 | BIT13 );   
    //digital input
    //GPIO_SetMode(PA, BIT6, GPIO_PMD_INPUT);      //input 1
    GPIO_SetMode(PA, BIT14, GPIO_PMD_INPUT);      //input 1
    GPIO_EnableInt(PA, 14, GPIO_INT_FALLING);
    NVIC_EnableIRQ(GPAB_IRQn);
    GPIO_SetMode(PA, BIT15, GPIO_PMD_INPUT);      //input 2
    GPIO_EnableInt(PA, 15, GPIO_INT_FALLING);
    NVIC_EnableIRQ(GPAB_IRQn);
    GPIO_SetMode(PA, BIT12, GPIO_PMD_INPUT);      //input3
    GPIO_EnableInt(PA, 12, GPIO_INT_FALLING);
    NVIC_EnableIRQ(GPAB_IRQn);
    GPIO_SetMode(PA, BIT13, GPIO_PMD_INPUT);      //input 4
    GPIO_EnableInt(PA, 13, GPIO_INT_FALLING);
    NVIC_EnableIRQ(GPAB_IRQn);
    
    //digital input //ring, emergency, ignition, 
    GPIO_SetMode(PB, BIT6, GPIO_PMD_INPUT);       //ring
//    GPIO_EnableInt(PB, 6, GPIO_INT_LOW);
//    NVIC_EnableIRQ(GPAB_IRQn);
    GPIO_SetMode(PB, BIT9, GPIO_PMD_INPUT);       //emerge5ncy
    GPIO_EnableInt(PB, 9, GPIO_INT_BOTH_EDGE);
    NVIC_EnableIRQ(GPAB_IRQn);
    GPIO_SetMode(PB, BIT10, GPIO_PMD_INPUT);      //ignition
    GPIO_EnableInt(PB, 10, GPIO_INT_BOTH_EDGE);
    NVIC_EnableIRQ(GPAB_IRQn);
    GPIO_SetMode(PB, BIT13, GPIO_PMD_INPUT);      //tamper
    GPIO_EnableInt(PB, 13, GPIO_INT_FALLING);
    NVIC_EnableIRQ(GPAB_IRQn);    
    
