mridulp-jft/telecom-gps/vtsOBD-2.0.0 - nuc130/KEIL/main.c
    GPIO_SetMode(PB, BIT8, GPIO_PMD_OUTPUT);       
    GPIO_SetMode(PB, BIT15, GPIO_PMD_OUTPUT);       
    GPIO_SetMode(PA, BIT7, GPIO_PMD_OUTPUT);       
    
    GPIO_SetMode(PC, BIT2, GPIO_PMD_OUTPUT);       
    GPIO_SetMode(PC, BIT3, GPIO_PMD_OUTPUT);       

//    
    PB8 = 1;
}


__inline void sendalert(){
  switch(alertid){
        case 0:
          break;
        case 3:
          send_sms(emernum1, "Alert – Disconnect from main battery");
          send_sms(emernum2, "Alert – Disconnect from main battery");
          break;
        case 4:
          send_sms(emernum1, "Alert – Low battery");
          send_sms(emernum2, "Alert – Low battery");          
          break;
        case 5:
          send_sms(emernum1, "Alert – Low battery removed");
          send_sms(emernum2, "Alert – Low battery removed");          
          break;
        case 6:
          send_sms(emernum1, "Alert – Connect back to main battery");
          send_sms(emernum2, "Alert – Connect back to main battery");          
          break;
        case 7:
          send_sms(emernum1, "Alert – Ignition ON");
          send_sms(emernum2, "Alert – Ignition ON");          
          break;
        case 8:
          send_sms(emernum1, "Alert – Ignition OFF");
          send_sms(emernum2, "Alert – Ignition OFF");          
          break;
        case 9:
          send_sms(emernum1, "Alert – GPS box opened");
          send_sms(emernum2, "Alert – GPS box opened");          
          break;
        case 10:
          send_sms(emernum1, "Alert – Emergency state ON*");
          send_sms(emernum2, "Alert – Emergency state ON*");          
          break;
        case 11:
          send_sms(emernum1, "Alert – Emergency state OFF*");
          send_sms(emernum2, "Alert – Emergency state OFF*");          
          break;        
        case 12:
          send_sms(emernum1, "Alert – over the air parameter change");
          send_sms(emernum2, "Alert – over the air parameter change");          
          break;    
        case 13:
          send_sms(emernum1, "Alert – Harsh Braking");
          send_sms(emernum2, "Alert – Harsh Braking*");          
          break;    
        case 14:
          send_sms(emernum1, "Alert – Harsh Acceleration");
          send_sms(emernum2, "Alert – Harsh Acceleration");          
          break;
        case 15:
          send_sms(emernum1, "Alert – Rash Turning");
          send_sms(emernum2, "Alert – Rash Turning");          
          break;    
  }
}

__inline void UARTs_Init()
{
    /*---------------------------------------------------------------------------------------------------------*/
    /* Init UART                                                                                               */
    /*---------------------------------------------------------------------------------------------------------*/
    /* Reset UART0 */
    SYS_ResetModule(UART0_RST);
    SYS_ResetModule(UART1_RST);
    SYS_ResetModule(UART2_RST);

    /* Configure UART0 and set UART0 Baudrate */
    UART_Open(UART0, 9600);             // ifdef DEBUG UART elseif RS232_1  
    UART_Open(UART1, 115200);           //MAIN UART MC60
    UART_Open(UART2, 9600);             // ifdef OBD UART elseif RS232_2
		UART_ENABLE_INT(UART1, (UART_IER_RDA_IEN_Msk ));
		NVIC_EnableIRQ(UART1_IRQn);  
		UART_ENABLE_INT(UART2, (UART_IER_RDA_IEN_Msk ));
		NVIC_EnableIRQ(UART02_IRQn);  
}

void UART1_IRQHandler(void)
{char uart1data;
    while(!UART_GET_RX_EMPTY(UART1)) 
    {
      uart1data = UART_READ(UART1);
      if(uart1data != '\0'){
        g_u8RecData[g_u8RecDataptr] = uart1data;
        g_u8RecDataptr++;
        if(g_u8RecDataptr > (RXBUFSIZE-10)){
          g_u8RecDataptr = 0;
        }
      tmr0sec=0;
      }
    }
}
void UART02_IRQHandler(void)
{
    while(!UART_GET_RX_EMPTY(UART2)) 
    {
      g_u8OBDRecData[g_u8OBDRecDataptr] = UART_READ(UART2);
      g_u8OBDRecDataptr++;
    }
}



__inline void Init_IOs(){
  /* Analog 
    PA.1:  Analog in (INTERNAL_BATT_VOLTAGE_MEASURE)
    PA.2:  Analog in (CAR BATT _ VOLTAGE_MEASURE)
    PA.2:  Analog_IN_1                              
    PA.3:  Analog_IN_2                              
    PA.4:  Analog_IN_3                              
    PA.5:  Analog_IN_4     
    PA.6:  Analog in (ANT_FB)
  */
  
  /* Digital In 
    PA.12: GPIO_IN (Digital_in_3)                         
    PA.13: GPIO_IN (Digital_in_4)                         
    PA.14: GPIO_IN (Digital_in_1)
    PA.15: GPIO_IN (Digital_in_2)
    PB.2:  GPIO_IN (External power removed)
    PE.5:  GPIO_IN (IPPS_INT)
    PB.9:  GPIO_IN (Panic_MCU_In)
    PB.10: GPIO_IN (Ignition_sense_In)
    PA.10:GPIO_IN (Acc_INT1)
    PA.11:GPIO_IN (Acc_INT2)
    PB.6:   GPIO _IN                            (MCU_RI)
//    PB13 : Tamper alert/ Case Open
//  */ 
//    GPIO_SetMode(PB, BIT6, GPIO_PMD_INPUT);      //Ring Indicator
//    GPIO_EnableInt(PB, 6, GPIO_INT_RISING);
//    NVIC_EnableIRQ(GPAB_IRQn);

//    GPIO_SetMode(PA, BIT10, GPIO_PMD_INPUT);     //Acc 1 Interrupt
//    GPIO_EnableInt(PA, 10, GPIO_INT_RISING);
//    NVIC_EnableIRQ(GPAB_IRQn); 
//    
//    GPIO_SetMode(PA, BIT11, GPIO_PMD_INPUT);     //Acc 2 Interrupt
//    GPIO_EnableInt(PA, 11, GPIO_INT_RISING);
//    NVIC_EnableIRQ(GPAB_IRQn); 
//    
//    GPIO_SetMode(PB, BIT10, GPIO_PMD_INPUT);     //Ignition Sense Interrupt
//        
//    GPIO_SetMode(PB, BIT9, GPIO_PMD_INPUT);     //Panic Button Interrupt
//    GPIO_EnableInt(PB, 9, GPIO_INT_RISING);
//    NVIC_EnableIRQ(GPAB_IRQn); 
//        
//    GPIO_SetMode(PA, BIT12, GPIO_PMD_INPUT);      //DIO3 Indicator
//    GPIO_EnableInt(PA, 12, GPIO_INT_RISING);
//    NVIC_EnableIRQ(GPAB_IRQn);
//    GPIO_SetMode(PA, BIT13, GPIO_PMD_INPUT);      //DIO4 Indicator
//    GPIO_EnableInt(PA, 13, GPIO_INT_RISING);
//    NVIC_EnableIRQ(GPAB_IRQn);
//    GPIO_SetMode(PA, BIT14, GPIO_PMD_INPUT);      //DIO1 Indicator
//    GPIO_EnableInt(PA, 14, GPIO_INT_RISING);
//    NVIC_EnableIRQ(GPAB_IRQn);
//    GPIO_SetMode(PA, BIT15, GPIO_PMD_INPUT);      //DIO2 Indicator
//    GPIO_EnableInt(PA, 15, GPIO_INT_RISING);
//    NVIC_EnableIRQ(GPAB_IRQn);  
    

  /* Digital Out 
    PB.7:   GPIO_OUT                         (MCU_DTR)
    PC.0:   GPIO_OUT (Acc_add_sel)
    PC.6: GPIO_OUT (Digital_out_1)	
    PC.7: GPIO_OUT (Digtial_out_2)
    PB.3:  GPIO_OUT (relay cutoff)
    PB.11: GPIO_OUT (pwr_key_reset)
    PB.15: GPIO_OUT (GSM_Modem_OFF)
    PC.14: GPIO_OUT (MCU_SELF_RESET)
    PC.16: GPIO_OUT (MCU_PWR_RESET)
    PB.8:   GPIO_OUT (EXT_ANT_SWITCH)
    PC.2:  GPIO_OUT (LED_DEBUG_1)
    PC.3:  GPIO_OUT (LED_DEBUG_2)
    PA.7:  GPIO_OUT (BATT_MEASURE_ENABLE)
  */  
}
__inline void remove_all_characters(char* str, int len, char c, char d) {
    int i=0;char *pr = str, *pw = str;
    for(i=0;i<len;i++){
        *pw = *pr++;
			pw += (*pw != c && *pw != d);
    }
    *pw = '\0';
}

