mridulp-jft/telecom-gps/vtsOBD-2.0.0 - nuc130/KEIL/main.c
__inline int hex_to_int(char c){
        int first = c / 16 - 3;
        int second = c % 16;
        int result = first*10 + second;
        if(result > 9) result--;
        return result;
}

__inline void hextoascii(char* string, int len){
  int high, low;
  char c,d;
  int i;
  memset(DestArray,0,257);
  for(i = 0; i< len-1; i+=2){
      c = string[i];
      d = string[i+1];
      high = hex_to_int(c) * 16;
      low = hex_to_int(d);
      DestArray[i] = high+low;
    }
  remove_all_characters(DestArray,257,0x00,0x00);
  }


void waitfor123(){
    osSignalWait (0x0123, osWaitForever); // wait forever for the signal 0x0001
    osSignalClear (mainThreadID, 0x0123);
}

void signal123(){
    osSignalSet (tid_Thread_OBD_READ, 0x0123);
}
void waitfor321(){
    osSignalWait (0x0321, osWaitForever); // wait forever for the signal 0x0001
    osSignalClear (tid_Thread_OBD_READ, 0x0321);
}

void signal321(){
    osSignalSet (mainThreadID, 0x0321);
}


void GPAB_IRQHandler(void){
  int trueint = 0;
    /* To check if PE.5 interrupt occurred */
//    if(GPIO_GET_INT_FLAG(PB, BIT15)){
//        GPIO_CLR_INT_FLAG(PB, BIT15);
//    }
//    if(GPIO_GET_INT_FLAG(PA, BIT14)){
//        GPIO_CLR_INT_FLAG(PA, BIT14);
//        input1 = 1;trueint = 1;
//    }if(GPIO_GET_INT_FLAG(PA, BIT15)){
//        GPIO_CLR_INT_FLAG(PA, BIT15);
//        input2 = 1;trueint = 1;
//    }if(GPIO_GET_INT_FLAG(PA, BIT12)){
//        GPIO_CLR_INT_FLAG(PA, BIT12);
//        input3 = 1;trueint = 1;
//    }if(GPIO_GET_INT_FLAG(PA, BIT13)){
//        GPIO_CLR_INT_FLAG(PA, BIT13);
//        input4 = 1;trueint = 1;
//    }  
//    if(GPIO_GET_INT_FLAG(PB, BIT6)){
//        GPIO_CLR_INT_FLAG(PB, BIT6);
//        ring = 1;trueint = 1;
//        //SendAT("\r\n\r\nAT\r\n\r\n","+CME ERROR", "OK" , "ERROR",10);

//    }
    if(GPIO_GET_INT_FLAG(PB, BIT9)){
        GPIO_CLR_INT_FLAG(PB, BIT9);
        emergencystatus = 1;
        if(PB9 == 0){
        emergencyhighlow = 1;
        }else{
          emergencyhighlow = 0;
        }
        trueint = 1;    
    }if(GPIO_GET_INT_FLAG(PB, BIT10)){   
        ignition = 1;trueint = 1;
      if(PB10 == 0){
        ignitionhighlow = 1;
      }else{
        ignitionhighlow = 0;
      }
      GPIO_CLR_INT_FLAG(PB, BIT10);
      trueint = 1;
    }
    if(GPIO_GET_INT_FLAG(PB, BIT13)){
        GPIO_CLR_INT_FLAG(PB, BIT13);
        tamperalert = 'O';trueint = 1;
    }
    
    
    
    
    if (trueint == 0)
    {
        /* Un-expected interrupt. Just clear all PC, PD, PE and PF interrupts */
        PB->ISRC = PB->ISRC;
        PA->ISRC = PA->ISRC;
    }
   //printf("\r\nAT+interrupt\r\n");
}

__inline void remove_all_alpha(char* str, char c, char d) {
    char *pr = str, *pw = str;
    while (*pr) {
        *pw = *pr++;
			pw += (*pw > 47 && *pw < 58);
    }
    *pw = '\0';
}
void WDT_IRQHandler(void)
{
    // Reload WWDT counter and clear WWDT interrupt flag
    WWDT_RELOAD_COUNTER();
    WWDT_CLEAR_INT_FLAG();
   // printf("WWDT counter reload\r\n");
//    while(1);
}

void TMR0_IRQHandler(void)
{
    if(TIMER_GetIntFlag(TIMER0) == 1)
    {
        /* Clear Timer0 time-out interrupt flag */
        TIMER_ClearIntFlag(TIMER0);
        interval_count++;
        interval_count_health++;
        tmr0sec++;
        //tmr1sec++;
        tcpsendchtimer++;
        tc++;
        i2ctimeout++;
        //if(emergencystatus == 1)
        wetmr+=1;
        wait++;
        PC2^=1;
        PC3^=1;

    }
}
void ADC_IRQHandler(void)
{
    g_u32AdcIntFlag = 1;
    ADC_CLR_INT_FLAG(ADC, ADC_ADF_INT); /* clear the A/D conversion flag */
}
